---
kind: property
id: P:Autodesk.Revit.DB.TilePattern.TilePatternType
source: html/867769b9-9e3b-614d-0c37-a55f16a9a024.htm
---
# Autodesk.Revit.DB.TilePattern.TilePatternType Property

The built-in system tile pattern specified by
this object.

## Syntax (C#)
```csharp
public TilePatternsBuiltIn TilePatternType { get; }
```